&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ГлавныйБухгалтер.Видимость = Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо");	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

КонецПроцедуры

&НаКлиенте
Процедура ИННОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СтандартнаяОбработка = Истина; 
	ДлинаИННЮрЛицо = 10;
	ДлинаИННИП = 12;
	ЭтоЮрЛицо = Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо");
	ТекстПредупрежденияЮрЛицо = СтрШаблон("%1 не может иметь ИНН отличный от %2 символов. Длина введенного ИНН %3 символов.", 
								Объект.ТипОрганизации, ДлинаИННЮрЛицо, СтрДлина(Текст));
	ТекстПредупрежденияИП = СтрШаблон("%1 не может иметь ИНН отличный от %2 символов. Длина введенного ИНН %3 символов.", 
							Объект.ТипОрганизации, ДлинаИННИП, СтрДлина(Текст)); 
                                                             
	Если ЭтоЮрЛицо Тогда
		Если СтрДлина(Текст) <> ДлинаИННЮрЛицо Тогда
			СтандартнаяОбработка = Ложь;
			ПоказатьПредупреждение(,ТекстПредупрежденияЮрЛицо);
		КонецЕсли;
	Иначе
		Если СтрДлина(Текст) <> ДлинаИННИП Тогда
			СтандартнаяОбработка = Ложь;
			ПоказатьПредупреждение(,ТекстПредупрежденияИП);
		КонецЕсли;
   КонецЕсли;
КонецПроцедуры
