
Процедура УстановитьВидимость()
	ЭтоАбонемент = Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Абонемент");
	ЭтоУслуга = Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга");
	Элементы.ДлительностьУслуги.Видимость = ЭтоУслуга;
	Элементы.ДнейЗаморозки.Видимость = ЭтоАбонемент;
	Элементы.СрокДействияАбонемента.Видимость = ЭтоАбонемент
КонецПроцедуры

&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	УстановитьВидимость();
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Материал") Тогда
		Объект.СчётБухгалтерскогоУчёта = ПредопределенноеЗначение("ПланСчетов.Хозрасчётный.Материалы");
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда
		Объект.СчётБухгалтерскогоУчёта = ПредопределенноеЗначение("ПланСчетов.Хозрасчётный.Товары");
	Иначе
		Объект.СчётБухгалтерскогоУчёта = ПредопределенноеЗначение("ПланСчетов.Хозрасчётный.РасходыНаПродажу");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	Если НЕ ЗначениеЗаполнено(Объект.ТипНоменклатуры) Тогда
		Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар");
		Объект.СчётБухгалтерскогоУчёта = ПредопределенноеЗначение("ПланСчетов.Хозрасчётный.Товары");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СчётБухгалтерскогоУчётаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
    СписокДоступныхЗначений = Новый СписокЗначений;    
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар")
		ИЛИ Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Материал") Тогда
        СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчётный.Материалы"));
        СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчётный.Товары"));
	ИначеЕсли  Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга")
			ИЛИ Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Абонемент") Тогда
        СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчётный.РасходыНаПродажу"));
        СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчётный.ПрочиеДоходыИРасходы"));
    Иначе
        СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчётный.ПустаяСсылка"));
    КонецЕсли;
    ДанныеВыбора = СписокДоступныхЗначений;
КонецПроцедуры
