
&НаКлиенте
Процедура УстановитьВидимость()
	ЭтоКлиент = Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент");
	ЭтоПокупатель = Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Покупатель");
	Если ЭтоКлиент Тогда
		Элементы.Наименование.Заголовок = "Ф.И.О.";
	КонецЕсли;
	Элементы.Договор.Видимость = ЭтоПокупатель;
	Элементы.ДатаРожденияКлиента.Видимость = ЭтоКлиент;
	Элементы.ПолКлиента.Видимость = ЭтоКлиент;
	Элементы.Абонемент.Видимость = ЭтоКлиент;
КонецПроцедуры

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

