&НаСервереБезКонтекста
Функция ПолучитьРеквизитСправочникаПоСсылке(Ссылка, РеквизитСтрокой, Справочник)
	Запрос = Новый Запрос;
	ТекстЗапроса = СтрШаблон("ВЫБРАТЬ
							|	%2.%1 КАК Искомое
							|ИЗ
							|	Справочник.%2 КАК %2
							|ГДЕ
							|	%2.Ссылка = &Ссылка", РеквизитСтрокой, Справочник);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий(); 
	Возврат Выборка.Искомое			
КонецФункции

&НаКлиенте
Процедура РассчитатьДатуОкончания()
	СекундВДне = 60 * 60 * 24;
	ДатаДляРасчетов = Объект.ДатаАктивации;
	Для сч = 1 По Объект.СрокДействия Цикл
		КоличествоДнейВМесяце = День(КонецМесяца(ДатаДляРасчетов));
		ДатаДляРасчетов = ДатаДляРасчетов + КоличествоДнейВМесяце * СекундВДне;
	КонецЦикла;
	Объект.ДатаОкончания = ДатаДляРасчетов + (Объект.Заморозки.Итог("ДнейЗаморозки") * СекундВДне);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьОстатокЗаморозки()
	Объект.ОстатокДнейЗаморозки = Объект.ДнейЗаморозки - Объект.Заморозки.Итог("ДнейЗаморозки");
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДлительностьЗаморозки(СтрокаТЧ)
	СекундВДне = 60 * 60 * 24;
	НачалоЗаморозки = СтрокаТЧ.ДатаНачала;
	ОкончаниеЗаморозки = СтрокаТЧ.ДатаОкончания;
	ОстатокЗаморозки = Объект.ОстатокДнейЗаморозки;  
	ДлительностьЗаморозкиДней = (ОкончаниеЗаморозки - НачалоЗаморозки) / СекундВДне;

	Если ДлительностьЗаморозкиДней >= ОстатокЗаморозки Тогда
		СтрокаТЧ.ДнейЗаморозки = ОстатокЗаморозки;
		СтрокаТЧ.ДатаОкончания = СтрокаТЧ.ДатаНачала + ОстатокЗаморозки * СекундВДне;
	Иначе
		СтрокаТЧ.ДнейЗаморозки = (ОкончаниеЗаморозки - НачалоЗаморозки) / СекундВДне;
		СтрокаТЧ.ДатаОкончания = СтрокаТЧ.ДатаНачала + ДлительностьЗаморозкиДней * СекундВДне;  
	КонецЕсли;
	РассчитатьОстатокЗаморозки();
	РассчитатьДатуОкончания();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	Владелец = ПолучитьРеквизитСправочникаПоСсылке(Объект.Владелец, "Наименование", "Контрагенты");
	Номенклатура = ПолучитьРеквизитСправочникаПоСсылке(Объект.Номенклатура, "Наименование", "Номенклатура");
	Объект.Наименование = Владелец + " (" + Номенклатура + ")";
	Объект.СрокДействия = ПолучитьРеквизитСправочникаПоСсылке(Объект.Номенклатура, "СрокДействияАбонемента", "Номенклатура");
	Объект.ДнейЗаморозки = ПолучитьРеквизитСправочникаПоСсылке(Объект.Номенклатура, "ДнейЗаморозки", "Номенклатура");
	РассчитатьДатуОкончания();
	РассчитатьОстатокЗаморозки();
КонецПроцедуры

&НаКлиенте
Процедура ДнейЗаморозкиПриИзменении(Элемент)
	РассчитатьОстатокЗаморозки();
КонецПроцедуры

&НаКлиенте
Процедура СрокДействияПриИзменении(Элемент)
	РассчитатьДатуОкончания();
КонецПроцедуры

&НаКлиенте
Процедура ЗаморозкиДатаОкончанияПриИзменении(Элемент)
	РассчитатьОстатокЗаморозки();
	СтрокаТЧ = Элементы.Заморозки.ТекущиеДанные;	
	РассчитатьДлительностьЗаморозки(СтрокаТЧ);
КонецПроцедуры

		  