
Процедура Печать(ТабДок, Ссылка) Экспорт
	Макет = Документы.Реализация.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реализация.Договор КАК Договор,
	|	Реализация.ДокументОснование КАК ДокументОснование,
	|	Реализация.Контрагент КАК Контрагент,
	|	Реализация.Ответственный КАК Ответственный,
	|	Реализация.Склад КАК Склад,
	|	Реализация.Сотрудник КАК Сотрудник,
	|	Реализация.СуммаДокумента КАК СуммаДокумента,
	|	Реализация.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Товары,
	|	Реализация.Услуги.(
	|		НомерСтроки КАК НомерСтроки,
	|		Услуга КАК Услуга,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Услуги,
	|	Реализация.Абонементы.(
	|		НомерСтроки КАК НомерСтроки,
	|		Абонемент КАК Абонемент,
	|		КоличествоМесяцев КАК КоличествоМесяцев,
	|		Активировать КАК Активировать,
	|		Стоимость КАК Стоимость
	|	) КАК Абонементы,
	|	Реализация.Номер КАК Номер,
	|	Реализация.Дата КАК Дата
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	ОбластьУслугиШапка = Макет.ПолучитьОбласть("УслугиШапка");
	ОбластьУслуги = Макет.ПолучитьОбласть("Услуги");
	ОбластьАбонементыШапка = Макет.ПолучитьОбласть("АбонементыШапка");
	ОбластьАбонементы = Макет.ПолучитьОбласть("Абонементы");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
	
		Если НЕ Выборка.Товары.Пустой() Тогда
			ТабДок.Вывести(ОбластьТоварыШапка);
			ВыборкаТовары = Выборка.Товары.Выбрать();
			Пока ВыборкаТовары.Следующий() Цикл
				ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
				ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
			КонецЦикла;
		КонецЕсли;
		
		Если НЕ Выборка.Услуги.Пустой() Тогда
		ТабДок.Вывести(ОбластьУслугиШапка);
		ВыборкаУслуги = Выборка.Услуги.Выбрать();
			Пока ВыборкаУслуги.Следующий() Цикл
				ОбластьУслуги.Параметры.Заполнить(ВыборкаУслуги);
				ТабДок.Вывести(ОбластьУслуги, ВыборкаУслуги.Уровень());
			КонецЦикла;
		КонецЕсли;
		
		Если НЕ Выборка.Абонементы.Пустой() Тогда
			ТабДок.Вывести(ОбластьАбонементыШапка);
			ВыборкаАбонементы = Выборка.Абонементы.Выбрать();
			Пока ВыборкаАбонементы.Следующий() Цикл
					ОбластьАбонементы.Параметры.Заполнить(ВыборкаАбонементы);
					ТабДок.Вывести(ОбластьАбонементы, ВыборкаАбонементы.Уровень());
	        КонецЦикла;
		КонецЕсли;
		
		ДанныеПодвал = Новый Структура();
		ДанныеПодвал.Вставить("СуммаПрописью", ЧислоПрописью(Выборка.СуммаДокумента, 
				"Л = ru_RU; ДП = Истина", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));
        ДанныеПодвал.Вставить("СуммаДокумента", Выборка.СуммаДокумента);
		ДанныеПодвал.Вставить("Ответственный", Выборка.Сотрудник);		
		ЗаполнитьЗначенияСвойств(Подвал.Параметры, ДанныеПодвал );
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
КонецПроцедуры
