&НаКлиенте
Процедура ПересчитатьСуммуДокумента()
	Объект.СуммаДокумента = Объект.Услуги.Итог("Сумма") + Объект.Абонементы.Итог("Стоимость");	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДлительностьАбонемента(Абонемент)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.СрокДействияАбонемента КАК СрокДействияАбонемента
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Абонемент);			   
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.СрокДействияАбонемента
	Иначе
		Возврат 0
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуНаКонкретнуюДату(СтрокаТЧ.Услуга, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	РаботаСТабЧастямиКлиент.ПересчитатьСуммуВСтрТЧ(СтрокаТЧ);
	ПересчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	РаботаСТабЧастямиКлиент.ПересчитатьСуммуВСтрТЧ(СтрокаТЧ);
	ПересчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура АбонементыАбонементПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Абонементы.ТекущиеДанные; 
	СтрокаТЧ.КоличествоМесяцев = ПолучитьДлительностьАбонемента(СтрокаТЧ.Абонемент);
	СтрокаТЧ.Стоимость = РаботаСЦенами.ПолучитьЦенуНаКонкретнуюДату(СтрокаТЧ.Абонемент, Объект.Дата);
	ПересчитатьСуммуДокумента();
КонецПроцедуры


