&НаСервереБезКонтекста
Функция ПолучитьТипКонтрагентаБулево(Плательщик)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.ТипКонтрагента КАК ТипКонтрагента
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Плательщик);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();

	Если ЗначениеЗаполнено(Выборка.ТипКонтрагента)
	    И Выборка.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент Тогда
	    Возврат Истина;
	Иначе
	    Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура УстановитьВидимость()
	ЭтоВозвратОтПодотчетника = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияденег.ВозвратОтПодотчётника");
	ЭтоКлиент = ПолучитьТипКонтрагентаБулево(Объект.Плательщик);
	
	СтрокаТипПлательщика = ?(ЭтоВозвратОтПодотчетника,
			"СправочникСсылка.Сотрудники",
			"СправочникСсылка.Контрагенты");
	
	Если ЗначениеЗаполнено(СтрокаТипПлательщика) Тогда
	    Массив = Новый Массив(); 
	    Массив.Добавить(Тип(СтрокаТипПлательщика));
	    ОписаниеТипаПлательщика = Новый ОписаниеТипов(Массив);
	    Элементы.Плательщик.ОграничениеТипа = ОписаниеТипаПлательщика;
	КонецЕсли;
	
	Элементы.Договор.Видимость = Ложь;
	Если НЕ ЭтоКлиент Тогда
		Элементы.Договор.Видимость = Истина;
		Если ЭтоВозвратОтПодотчетника Тогда
			Элементы.Договор.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры


