&НаСервереБезКонтекста
Функция ПолучитьТипКонтрагентаБулево(Получатель)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.ТипКонтрагента КАК ТипКонтрагента
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Получатель);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();

	Если ЗначениеЗаполнено(Выборка.ТипКонтрагента)
	    И Выборка.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент Тогда
	    Возврат Истина;
	Иначе
	    Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура УстановитьВидимость()
	ЭтоРасчетыССотрудниками = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаЗаработнойплаты")) 
		ИЛИ (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаПодотчётнику"));
	ЭтоКлиент = ПолучитьТипКонтрагентаБулево(Объект.Получатель);
	
	СтрокаТипПлательщика = ?(ЭтоРасчетыССотрудниками,
			"СправочникСсылка.Сотрудники",
			"СправочникСсылка.Контрагенты");
	
	Если ЗначениеЗаполнено(СтрокаТипПлательщика) Тогда
	    Массив = Новый Массив(); 
	    Массив.Добавить(Тип(СтрокаТипПлательщика));
	    ОписаниеТипаПолучателя = Новый ОписаниеТипов(Массив);
	    Элементы.Получатель.ОграничениеТипа = ОписаниеТипаПолучателя;
	КонецЕсли;
	
	Элементы.Договор.Видимость = Ложь;
	Если НЕ ЭтоКлиент Тогда
		Элементы.Договор.Видимость = Истина;
		Если ЭтоРасчетыССотрудниками Тогда
			Элементы.Договор.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

